[ 
  {
   "group": "template-group",
    "title": "template 1",
    "content": "Okay, so I would be happy to assist, but this would be outside of my scope of what I can do. You would need to contact our concierge service team."
  },
  {
   "group": "template-group",
    "title": "template 2",
    "content": "It will get you transferred now. It will say that I have disconnected; this would be for the next agent to connect you to your chat."
  },
  {
   "group": "template-group",
    "title": "template 3",
    "content": "If you are wanting to price match with another company, unfortunately, we do not. If you purchased something online and see that the price has dropped and you purchased that item 30 days prior, we can adjust the price to the new."
  },
  {
   "group": "template-group",
    "title": "template 4",
    "content": "You would be able to see this on the tracking you received. But the evening before your delivery, you will receive a call from our automated system with a 2-hour time frame for the delivery of your merchandise. This tracking would also be updated with the timeframe around this time as well. The default time would be 7 - 10 PM; this would not be the timeframe if you use the tracking on this order."
  },
  {
   "group": "template-group",
    "title": "templaggVGte 5",
    "content": "Hello, I would be happy to assist today. But unfortunately, you would need to visit your local warehouse for assistance with a purchase that was done in a warehouse. I unfortunately do not have any access to the systems they would use to assist you with this."
  },
  {
   "group": "template-group",
    "title": "template 6",
    "content": "I do apologize and hope this gets solved. If there is anything else I can help with, though, I would gladly assist."
  },
  {
   "group": "template-group",
    "title": "template 7",
    "content": "Okay, I have submitted a request for this to be replaced. Once this is accepted, our returns would look into the situation. Once this concludes, they would be creating a new order. Once this order gets created and ships, you would receive confirmation of shipment with the new tracking."
  },
  {
   "group": "template-group",
    "title": "template 8",
    "content": "Okay, I could not verify the information that was provided. I am no longer able to attempt to assist here. I would double-check the information that you have used for this order and chat or call back at a later time. If you have any questions that would not be related to this order or account that this was placed on, I would be happy to assist."
  },
  {
   "group": "template-group",
    "title": "template 9",
    "content": "Great, I am glad that I was able to help. I do hope that you have great holidays."
  },
  {
   "group": "template-group",
    "title": "template 10",
    "content": "Okay, for this, I would need to get you to our membership department. They should be able to help since this is something that the warehouse does. I do apologize I am unable to assist."
  },
  {
   "group": "template-group",
    "title": "template 11",
    "content": "Thank you. So based on how long this has been shown to not be moving, this could be considered lost, but delays can take this long. So I can look into getting an exchange order requested or even a refund for the lost item."
  },
  {
   "group": "template-group",
    "title": "template 12",
    "content": "Okay, seeing that this was marked as delivered, I would be able to request two things here. This can be requested an exchange or refund for the lost item."
  },
  {
   "group": "template-group",
    "title": "template 13",
    "content": "$incidents.ref_no"
  },
  {
   "group": "template-group",
    "title": "template 14",
    "content": "Okay, I am submitting this request for a new order. This should be created within two days after our returns team traces the lost item. You will be notified once shipped. This will be an email confirmation that will include tracking for the new order."
  },
  {
   "group": "template-group",
    "title": "template 15",
    "content": "Hi there $contacts.name.first!! I do apologize about this issue. I'd be more than happy to assist you today. So thank you for reaching out to Costco Member Service for assistance. I wanna ask how is your day today? while I get everything pulled up."
  },
  {
   "group": "template-group",
    "title": "template 16",
    "content": "Just one last thing, could you verify one of the item's name or brand on your order for me so that I know I am looking at the correct order?"
  },
  {
   "group": "template-group",
    "title": "template 17",
    "content": "This is set for delivery tomorrow. A bunch of times these are already loaded on the truck. Rescheduling it means the item takes a tour of the local area for free, getting a chance for bumps and bruises. We really encourage our members to keep the delivery appointments."
  },
  {
   "group": "template-group",
    "title": "template 18",
    "content": "Thank you. Before submitting a request, I will want to advise you of the self-service options to get this fixed and avoid the wait of connecting with an agent. [URL: https://customerservice.costco.com/app/answers/detail/a_id/6874] Return or Replace your Costco.com Online Order"
  },
  {
   "group": "template-group",
    "title": "template 19",
    "content": "I can certainly submit your request for a return. Our returns team will be in contact with you within the next 3 business days on the next steps. Do you have any additional questions?"
  },
  {
   "group": "template-group",
    "title": "template 20",
    "content": "Could I have you verify the shipping address and name on this shipping address?"
  },
  {
   "group": "template-group",
    "title": "template 21",
    "content": "I am sorry I missed you today. Please chat back, and any available agent would assist as best they can."
  },
  {
   "group": "template-group",
    "title": "template 22",
    "content": "Again, I do apologize about this issue $contacts.name.first. Give me just one moment to look into this order."
  },
  {
   "group": "template-group",
    "title": "template 23",
    "content": "Hi there $contacts.name.first! I do apologize that this is not meeting your needs. But thank you for reaching out to Costco Member Service for assistance. To ensure that we have the correct information on file, could you verify your shipping address and name on that shipping address? Then I will get right to see what we can do for you."
  },
  {
   "group": "template-group",
    "title": "template 24",
    "content": "I can certainly submit your request for a return. Our returns team will be in contact with you within the next 3 business days on the next steps. Do you have any additional questions?"
  },
  {
   "group": "template-group",
    "title": "template 25",
    "content": "I do apologize, but customer service would not have information as to when an item would be back in stock as this would be done by a buying team. Since all items are going to be while supplies last. All items are essentially first come first serve."
  },
  {
   "group": "template-group",
    "title": "template 26",
    "content": "It will say that I have disconnected. This is so that the next agent would be able to connect to this chat."
  },
  {
   "group": "template-group",
    "title": "template 27",
    "content": "Hi there! I do apologize that this has not gotten to you. But thank you for reaching out to Costco Member Service for assistance. To ensure that we have the correct information on file, could you verify your shipping address and name on that shipping address?"
  },
  {
   "group": "template-group",
    "title": "template 28",
    "content": "I do apologize about this issue. But thank you for reaching out to Costco Member Service for assistance. So this is an issue that we are currently aware of and have a team actively working on fixing this. One fix that consistently works at this time would be to clear your cache and cookies and make sure that you are logged in on only one device. After doing this, log in using an incognito window. To open an Incognito Window in Chrome, open the Chrome Menu in the upper-right-hand corner of the browser window and select New Incognito Window. You can also use the shortcut Shift + ⌘ + N (on macOS), or Shift + CTRL + N (on Windows/Linux)."
  },
  {
   "group": "template-group",
    "title": "template 29",
    "content": ""
  },
  {
   "group": "template-group",
    "title": "template 30",
    "content": "Hi there $contacts.name.first!! I do apologize about this issue. I'd be more than happy to assist you today. So thank you for reaching out to Costco Member Service for assistance. I want to ask how is your day today? While I get everything pulled up."
  },
  {
    "group": "template-group",
    "title": "AA",
    "content": "(\"OrderNum\") // (\"Name\") // The member // DejonM8389OKC"
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I'm sorry I missed your chat today. Please contact us again for the next available agent to help with any questions you may have. Have a great day!\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I have cancelled the order. Is there anything else that you may need assistance with today?\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"What you would likely be seeing is the pre-authorization hold. For this, we have to request from your financial institution to hold the funds until the item is shipped. Based on their policy, this hold would fall off your account typically within 3 - 5 business days, but their policy could be different from most banks. I would advise asking about pre-authorization with your institution for more clarification on when this hold falls off your account if you are seeing two charges at once.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Your shipment will be picked up the same manner it was delivered (e.g., boxed, curbside, threshold, white-glove). The freight carrier will contact you within the next 5-7 business days to schedule the pickup appointment. You'll receive an email with more information from costco_ops@operations.costco.com.\"\n\n\"This will take about 2 - 3 business days for this to be refunded.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"My orders: [Link to form]\"\n\"Return FAQ: [Link to return FAQ]\"\n\"Price adjustment: [Link to form]\"\n\"Cancel order [Link to form]\"\n\"Verify membership: [Link to FAQs]\"\n\"Update account info: [Link to FAQs]\"\n\"In-home delivery FAQs [Link to FAQs]\"\n\"Appliance FAQs: [Link to FAQs]\"\n\"Contact information: [Link to contact information]\"\n\"Feedback FAQ: [Link to feedback FAQ]\"\n\"Cookies technical help: [Link to FAQs]\"\n\"Accepted payments: [Link to FAQs]\"\n\"Return policy: [Link to FAQ]\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Okay, I have submitted a request for this to be replaced. Once this is accepted, our returns team would look into the situation. Once this concludes, they would be creating a new order. Once this order is created and ships, you would receive confirmation of shipment with the new tracking.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"This FAQ article would list how to change account information\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Closing bye bye.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Great, I am glad that I was able to help. I do hope that you have great holidays.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I do also understand that you feel as though I do not understand what you are asking, but with so much time in between the chats between us, I do believe it would be better for you to call in for assistance.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Have you checked your spam or junk mail folder? Sometimes emails can be mistakenly filtered into these folders, especially if you have not received emails from the sender before.\"\n\"Make sure that you have entered the correct email address. It's possible that you may have entered the incorrect email address.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I currently do not have all of the information on this delivery, but it looks like it is being handled by our logistics team. I would recommend contacting our logistics team as they should have more information on this order's status. I will pass this to my resolutions team, and they will provide you with an update.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Okay, for this, I would need to transfer you to our membership department as this is something that the warehouse handles. I apologize for being unable to assist. I wish you a great holiday season.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Once I transfer you, it will show that I have disconnected. This is so that the membership agent can connect to this chat.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I will submit a request to cancel this order, but I cannot guarantee that this will be canceled.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Thank you! Based on how long this has been shown to not be moving, this could be considered lost. I can look into requesting an exchange order or refund. What would be the best option for you at this time if waiting is not an option?\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Could you verify one of the item's names or brands on your order for me so that I know I am looking at the correct order?\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Place holder\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I can certainly submit your request for a return. Our returns team will be in contact with you within the next 3 business days regarding the next steps. Do you have any additional questions?\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Could I have you verify the shipping address and name on this shipping address?\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I'm sorry I missed you today. Please chat back, and any available agent will assist as best they can.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"I apologize for this issue. Give me just one moment to look into this order.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Thank you for reaching out to Costco Member Service. To ensure that we have the correct information on file, could you verify your shipping address and name on that shipping address? Then I will see what we can do for you.\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Thank you for reaching out to Costco Member Service. I would be able to assist with this. But first, are you aware that there are self-service options that you can use to resolve this on your own? This FAQ article would help. Otherwise, let's get started. Firstly, to ensure that we have the correct information on file, could you verify your shipping address and name on that shipping address?\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"(\"OrderNum\") // (\"Name\") // The member // DejonM8389OKC\"\n\"(\"OrderNum\") // (\"Name\") // The Agent (\"AGENTNAME\") called // DejonM8389OKC\"\n\"(\"OrderNum\") // (\"Name\") // 1 + 1 + 1 // DejonM8389OKC\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Thank you for reaching out regarding your order. I understand that you would like to cancel your order. To assist you with this, please provide me with the following details:\n\nOrder number: [Insert Order Number]\nItem(s) you wish to cancel: [Insert Item Name(s)]\nOnce I have these details, I will submit a request to cancel the order on your behalf. Please note that cancellation requests are subject to review and approval, and I cannot guarantee that the order will be canceled. You will receive confirmation of the cancellation status via email or phone once it has been processed.\n\nIf you have any additional questions or need further assistance, please let me know. I'm here to help!\""
  },
  {
    "group": "template-group",
    "title": "",
    "content": "\"Thank you for reaching out to Costco Member Service. I apologize for any inconvenience caused, but it appears that you have reached the wrong team for your inquiry.\n\nIf you are located in Canada, I recommend contacting our dedicated Canadian Customer Service team for assistance with your specific needs. They have the expertise and resources to address your concerns accurately.\n\nYou can reach the Canadian Customer Service team by phone at [Canadian Customer Service Phone Number] or by visiting the Costco Canada website and selecting the appropriate contact options.\n\nPlease note that each Costco region has its own customer service team to ensure the best support for our members. If you are located outside Canada, please refer to the contact information specific to your region available on the respective Costco website.\n\nWe apologize for any confusion and appreciate your understanding. If you have any further questions or need assistance with anything else, please feel free to let us know, and we'll be happy to help.\""
  }
]

